content-org/blog.org
;; -*- mode: Org; org-download-image-dir: "../static/images/posts"; org-download-heading-lvl: 1; org-download-display-inline-images: nil; org-download-timestamp: "" -*-

#+TITLE: Posts
#+HUGO_BASE_DIR: ../
#+HUGO_SECTION: blog
#+SEQ_TODO: TODO DONE
#+PROPERTY: header-args :eval never-export
#+OPTIONS: creator:t toc:nil

** DONE Easy slides (for me)
CLOSED: [2019-04-21 Sun 14:16]
:PROPERTIES:
:EXPORT_FILE_NAME: easy-slides-for-me
:END:

As a software developer, at some point you discover simple slides and presentation generators: Markdown-to-PDF/HTML converters, Emacs extensions, LaTeX exporters, VIM plugins, etc. The idea makes perfect sense, because:

1. I don't want to use PowerPoint or Keynote.
2. I don't want to use the mouse.
3. I want plain text.
4. I want simplicity.

You can create presentations without leaving your favourite editor or command line. But unfortunately, the majority of the results are just text with an occasional poorly positioned funny GIF (that didn't load because wifi is down).

I completely understand the desire to make things as simple as possible and forget about clunky GUI-based presentation software. I don't like them either, and yeah, I'd love to be able to do things from the comfort of my text editor. You might say that text is mostly enough, animations and other flashy effects don't contribute to the value.

But I argue that animations, visualizations and transitions are tools, and like any other tool, they add value when used correctly. By sticking to text-only slide generators, you disregard a whole set of tools and potentially a whole set of problems they might help solve.

A title flying out from the corner probably doesn't do any good, the effect has no meaning. But if you want to explain something non-trivial (not to you, but to your audience), consider using /something/ to illustrate your point or even just to focus viewer's attention. It's not about animation or burning flames effect, it's about /anything/ above the typewriter in the pyramid of technology.

Dimming. Colors. Shapes. Transparency.

Computer science is full of complex ideas, multiple levels of abstraction, non-obvious connections and relations. It pains me to see whole presentations, thick books and long manuals with essentially zero visuals, zero attempt to convey an idea with something other than text.

Your slim Markdown-to-PDF converter serves one purpose: make /your/ life easier. Nothing wrong with that. But there are also viewers who might benefit from a more detailed visual presentation. Of course, not all viewers would. For many, text and your speech are more than enough, after all, many of us became programmers because of the ability to understand complex, abstract, non-visual ideas to begin with. This is where lack of diversity starts from, I believe. We filter out people by their adaptability to certain styles and formats of explanations. We filter out people by their learning medium.

/You need a cartoon to understand closures? Good luck. Maybe, programming isn't for you?../

Now, I understand that it takes time, and you might just not have enough of it. I am not bashing these wonderful tools and not saying you /must/ produce visuals and animations. I just wanted to remind you that plain-text presentations are compromises. It's absolutely fine to mindfully and intentionally make compromises.
